# Data Cleaning 

#### 1. Import pandas library.

In [2]:
import pandas as pd
pd.__version__

'1.2.4'

#### 2. Import the users table.

In [48]:
users = pd.read_csv(r"/Users/elinaneu/Desktop/Ironhack/Week 2/Tag2/Labs/lab-data-cleaning/data/users.csv")
users = users.drop("Unnamed: 0", axis = 1)
users.head(20)

    Id  Reputation  Views  UpVotes  DownVotes
0   -1           1      0     5007       1920
1    2         101     25        3          0
2    3         101     22       19          0
3    4         101     11        0          0
4    5        6792   1145      662          5
5    6         457    114       47          0
6    7         429     56       20          0
7    8        6764   1089      604         25
8   10         121     20        2          0
9   11         136     10       10          0
10  12         101     10        5          0
11  13         817    178       44          1
12  15          11      8        0          0
13  16         101      4        7          0
14  17         345     14       13          1
15  18         128      8       16          0
16  19         101     13        2          0
17  21         101      6        0          0
18  22         591     90      693          6
19  23         308     52       34          1

#### 3. Rename Id column to userId.

In [49]:
users = users.rename(columns={'Id': 'userId'})
users.head(20)

    userId  Reputation  Views  UpVotes  DownVotes
0       -1           1      0     5007       1920
1        2         101     25        3          0
2        3         101     22       19          0
3        4         101     11        0          0
4        5        6792   1145      662          5
5        6         457    114       47          0
6        7         429     56       20          0
7        8        6764   1089      604         25
8       10         121     20        2          0
9       11         136     10       10          0
10      12         101     10        5          0
11      13         817    178       44          1
12      15          11      8        0          0
13      16         101      4        7          0
14      17         345     14       13          1
15      18         128      8       16          0
16      19         101     13        2          0
17      21         101      6        0          0
18      22         591     90      693          6
19      23         308     52       34          1

#### 4. Import the posts table.

In [69]:
posts = pd.read_csv("/Users/elinaneu/Desktop/Ironhack/Week 2/Tag2/Labs/lab-data-cleaning/data/posts.csv")
posts = posts.drop("Unnamed: 0", axis = 1)
posts.head(20)

    Id  OwnerUserId  Score  ViewCount  CommentCount
0    1          8.0     23     1278.0             1
1    2         24.0     22     8198.0             1
2    3         18.0     54     3613.0             4
3    4         23.0     13     5224.0             2
4    5         23.0     81        NaN             3
5    6          5.0    152    29229.0             5
6    7         38.0     76     5808.0             3
7    8         37.0      0      288.0             2
8    9         50.0     13        NaN             3
9   10         24.0     23    21925.0             4
10  11         34.0      2      224.0             2
11  12          5.0     20        NaN             1
12  13         23.0     14        NaN             4
13  14         36.0      5        NaN             1
14  15          6.0     13        NaN             0
15  16          8.0     16        NaN             3
16  17          NaN      9     1261.0             0
17  18         36.0     31        NaN             1
18  19         55.0     12        NaN             0
19  20         37.0      3        NaN             2

#### 5. Rename Id column to postId and OwnerUserId to userId.

In [74]:
posts_1 = posts.rename(columns={'Id': 'postId', 'OwnerUserId':'userId'})
posts_1.head(20)

    postId  userId  Score  ViewCount  CommentCount
0        1     8.0     23     1278.0             1
1        2    24.0     22     8198.0             1
2        3    18.0     54     3613.0             4
3        4    23.0     13     5224.0             2
4        5    23.0     81        NaN             3
5        6     5.0    152    29229.0             5
6        7    38.0     76     5808.0             3
7        8    37.0      0      288.0             2
8        9    50.0     13        NaN             3
9       10    24.0     23    21925.0             4
10      11    34.0      2      224.0             2
11      12     5.0     20        NaN             1
12      13    23.0     14        NaN             4
13      14    36.0      5        NaN             1
14      15     6.0     13        NaN             0
15      16     8.0     16        NaN             3
16      17     NaN      9     1261.0             0
17      18    36.0     31        NaN             1
18      19    55.0     12        NaN             0
19      20    37.0      3        NaN             2

#### 6. Define new dataframes for users and posts with the following selected columns:
**users_sliced columns**: userId, Reputation, Views, UpVotes      
**posts_sliced columns**: postId, Score, userId, ViewCount

In [75]:
users_sliced = users[["userId", "Reputation", "Views", "UpVotes"]]
users_sliced.head(20)

    userId  Reputation  Views  UpVotes
0       -1           1      0     5007
1        2         101     25        3
2        3         101     22       19
3        4         101     11        0
4        5        6792   1145      662
5        6         457    114       47
6        7         429     56       20
7        8        6764   1089      604
8       10         121     20        2
9       11         136     10       10
10      12         101     10        5
11      13         817    178       44
12      15          11      8        0
13      16         101      4        7
14      17         345     14       13
15      18         128      8       16
16      19         101     13        2
17      21         101      6        0
18      22         591     90      693
19      23         308     52       34

In [76]:
posts_sliced = posts_1[['postId', 'Score', 'userId', 'ViewCount']]
posts_sliced.head(20)

    postId  Score  userId  ViewCount
0        1     23     8.0     1278.0
1        2     22    24.0     8198.0
2        3     54    18.0     3613.0
3        4     13    23.0     5224.0
4        5     81    23.0        NaN
5        6    152     5.0    29229.0
6        7     76    38.0     5808.0
7        8      0    37.0      288.0
8        9     13    50.0        NaN
9       10     23    24.0    21925.0
10      11      2    34.0      224.0
11      12     20     5.0        NaN
12      13     14    23.0        NaN
13      14      5    36.0        NaN
14      15     13     6.0        NaN
15      16     16     8.0        NaN
16      17      9     NaN     1261.0
17      18     31    36.0        NaN
18      19     12    55.0        NaN
19      20      3    37.0        NaN

#### 7. Merge the two dataframes created in the step above (8), users_sliced and posts_sliced. 
You will need to make a [merge](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html) of posts and users dataframes.

In [88]:
users_posts = posts_sliced.merge(users_sliced)
users_posts.head()

   postId  Score  userId  ViewCount  Reputation  Views  UpVotes
0       1     23     8.0     1278.0        6764   1089      604
1      16     16     8.0        NaN        6764   1089      604
2      36     41     8.0    67396.0        6764   1089      604
3      65     14     8.0        NaN        6764   1089      604
4      78     33     8.0        NaN        6764   1089      604

#### 8. How many missing values do you have in your merged dataframe? On which columns?

In [93]:
users_posts.isnull().sum()

postId            0
Score             0
userId            0
ViewCount     48396
Reputation        0
Views             0
UpVotes           0
dtype: int64

#### 9. You will need to make something with missing values.  Will you clean or filling them? Explain. 
**Remember** to check the results of your code before going to the next step.

In [95]:
#clean them as it is only one column which is missing the 
users_posts_n = users_posts.drop("ViewCount", axis = 1)
users_posts_n.head()

   postId  Score  userId  Reputation  Views  UpVotes
0       1     23     8.0        6764   1089      604
1      16     16     8.0        6764   1089      604
2      36     41     8.0        6764   1089      604
3      65     14     8.0        6764   1089      604
4      78     33     8.0        6764   1089      604